docs/posts/2023-12-08-use-common-lisp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-22 Mon 13:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Just Use Common Lisp</title>
<meta name="author" content="Britt Anderson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="preamble" class="status">
<nav>
&emsp; <a href="/index.html">Home</a>
&emsp; <a href="/about.html">About</a>
&emsp; <a href="/pubs.html">Publications</a>
&emsp; <a href="/posts.html">Posts</a>
&emsp; <a href="/posts/theindex.html">Posts by Topics</a>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">Just Use Common Lisp</h1>
<div id="outline-container-orge6caecd" class="outline-2">
<h2 id="orge6caecd"><span class="section-number-2">1.</span> Why Aren't We All Just Coding in Common Lisp?</h2>
<div class="outline-text-2" id="text-1">
<p>
There is history here, and I don't have the expertise to revisit it or adjudicate, but I can say that my beginner's experience with <b>Common Lisp</b> has been very favorable.
</p>
</div>
</div>
<div id="outline-container-orgbbba110" class="outline-2">
<h2 id="orgbbba110"><span class="section-number-2">2.</span> What Do I Like?</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><p>
The language is stable.
I have gone from Python2 to Python3. I tried to use Haskell, but as someone who codes intermittently it was always days of fixing a broken installation before I could resume learning. Idris published a book to teach you how to program with dependent types and then just withered while the designers re-invent it. Common Lisp just is. It goes back to the days of giants when we built bridges, subways, and software standards.
</p>

<p>
Working with a group of undergraduates to explore an older, but interesting, neural network model: <a href="https://www.cs.cmu.edu/~sef/sefCascor.htm">Cascade Correlation</a> I was able to run the <code>cc.lsp</code> file in SBCL/emacs/slime with no changes! There were a few deprecation warnings (old keywords for an <code>eval-when</code> function), but that was it. Anyone want to try and get 30 year old &lt;enter language here&gt; to run <sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>?
</p></li>

<li>The language is modern.
When the Lisp grandfathers (recognizable by the gray neck beards) tout the advantages of their language the new generation's response is often, but we have lisp-language-feature-* in &lt;enter language here&gt; now. And, except for the macro system it is basically true. That is why I say the language is modern. The "new" additions to contemporary, popular languages are there in Lisp. So, Lisp feels modern.</li>

<li>The Lisp community is the right size.
There was a time when Hackage for Haskell was great, but it didn't scale well. As Haskell grew in popularity, and as all those bright young minds graduated and found jobs in our e-commerce-centric world the centre of mass of the language shifted to block chain and web back ends. Lisp has plenty of young and old users. It has the quicklisp/ultralisp package repository that reminds one of the good old days of hackage. There are enough young people to push the language forward, but not so many that you get lost in a sea of incompatibilities. I feel though, it may be getting close.</li>

<li>There is still a genie in the Lisp bottle.
Objects are old news, but the common lisp object system was new to me. And the idea of multiple dispatch is cool. Objects that beget objects with wonderful effects, a consequence I think of the metaobject protocol is still something new to learn. And macros really are cool. They are not perhaps as strange as one is led to believe when they are simply described, rather than experienced, but still, being able to use <code>macrolet</code> to define a local macro that has scope within the function that calls it to rewrite code that appears later in the function can save a lot of boiler plate. Writing code that writes code is still an under exploited tool.</li>
</ol>
</div>
</div>
<div id="outline-container-org4a06c63" class="outline-2">
<h2 id="org4a06c63"><span class="section-number-2">3.</span> So What Are Lisp Hackers Saying Now?</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="https://leanpub.com/lisphackers/read">https://leanpub.com/lisphackers/read</a></li>
<li>Want to meet them?
<a href="https://european-lisp-symposium.org/2024/">https://european-lisp-symposium.org/2024/</a></li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
The recurrent version of the cascade correlation was harder, but still fairly easy. It used a different compiler, the <a href="https://cmucl.org/">cmucl compiler</a>. But the love of Lispers for their language means that even this 32 bit compiler is alive and well and completely usable. And for me it was an easy install on <a href="https://archlinux.org/packages/multilib/x86_64/cmucl/">ArchLinux</a>. I did have to edit out some of the older code for the visualizations and windows management.   
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: 2023-12-08 Fri 00:00</p>
<p class="author">Author: Britt Anderson</p>
<p class="date">Created: 2024-01-22 Mon 13:06</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
